txt1994/ARM/HC32_Template/User/hc32f4a0sitb.h
/*******************************************************************************
                Bit definition for Peripheral TMR0
*******************************************************************************/
/*  Bit definition for TMR0_CNTAR register  */
#define TMR0_CNTAR_CNTA                                (0x0000FFFFUL)

/*  Bit definition for TMR0_CNTBR register  */
#define TMR0_CNTBR_CNTB                                (0x0000FFFFUL)

/*  Bit definition for TMR0_CMPAR register  */
#define TMR0_CMPAR_CMPA                                (0x0000FFFFUL)

/*  Bit definition for TMR0_CMPBR register  */
#define TMR0_CMPBR_CMPB                                (0x0000FFFFUL)

/*  Bit definition for TMR0_BCONR register  */
#define TMR0_BCONR_CSTA_POS                            (0U)
#define TMR0_BCONR_CSTA                                (0x00000001UL)
#define TMR0_BCONR_CAPMDA_POS                          (1U)
#define TMR0_BCONR_CAPMDA                              (0x00000002UL)
#define TMR0_BCONR_INTENA_POS                          (2U)
#define TMR0_BCONR_INTENA                              (0x00000004UL)
#define TMR0_BCONR_CKDIVA_POS                          (4U)
#define TMR0_BCONR_CKDIVA                              (0x000000F0UL)
#define TMR0_BCONR_SYNSA_POS                           (8U)
#define TMR0_BCONR_SYNSA                               (0x00000100UL)
#define TMR0_BCONR_SYNCLKA_POS                         (9U)
#define TMR0_BCONR_SYNCLKA                             (0x00000200UL)
#define TMR0_BCONR_ASYNCLKA_POS                        (10U)
#define TMR0_BCONR_ASYNCLKA                            (0x00000400UL)
#define TMR0_BCONR_HSTAA_POS                           (12U)
#define TMR0_BCONR_HSTAA                               (0x00001000UL)
#define TMR0_BCONR_HSTPA_POS                           (13U)
#define TMR0_BCONR_HSTPA                               (0x00002000UL)
#define TMR0_BCONR_HCLEA_POS                           (14U)
#define TMR0_BCONR_HCLEA                               (0x00004000UL)
#define TMR0_BCONR_HICPA_POS                           (15U)
#define TMR0_BCONR_HICPA                               (0x00008000UL)
#define TMR0_BCONR_CSTB_POS                            (16U)
#define TMR0_BCONR_CSTB                                (0x00010000UL)
#define TMR0_BCONR_CAPMDB_POS                          (17U)
#define TMR0_BCONR_CAPMDB                              (0x00020000UL)
#define TMR0_BCONR_INTENB_POS                          (18U)
#define TMR0_BCONR_INTENB                              (0x00040000UL)
#define TMR0_BCONR_CKDIVB_POS                          (20U)
#define TMR0_BCONR_CKDIVB                              (0x00F00000UL)
#define TMR0_BCONR_SYNSB_POS                           (24U)
#define TMR0_BCONR_SYNSB                               (0x01000000UL)
#define TMR0_BCONR_SYNCLKB_POS                         (25U)
#define TMR0_BCONR_SYNCLKB                             (0x02000000UL)
#define TMR0_BCONR_ASYNCLKB_POS                        (26U)
#define TMR0_BCONR_ASYNCLKB                            (0x04000000UL)
#define TMR0_BCONR_HSTAB_POS                           (28U)
#define TMR0_BCONR_HSTAB                               (0x10000000UL)
#define TMR0_BCONR_HSTPB_POS                           (29U)
#define TMR0_BCONR_HSTPB                               (0x20000000UL)
#define TMR0_BCONR_HCLEB_POS                           (30U)
#define TMR0_BCONR_HCLEB                               (0x40000000UL)
#define TMR0_BCONR_HICPB_POS                           (31U)
#define TMR0_BCONR_HICPB                               (0x80000000UL)

/*  Bit definition for TMR0_STFLR register  */
#define TMR0_STFLR_CMFA_POS                            (0U)
#define TMR0_STFLR_CMFA                                (0x00000001UL)
#define TMR0_STFLR_CMFB_POS                            (16U)
#define TMR0_STFLR_CMFB                                (0x00010000UL)

/*******************************************************************************
                Bit definition for Peripheral TMR2
*******************************************************************************/
/*  Bit definition for TMR2_CNTAR register  */
#define TMR2_CNTAR_CNTA                                (0x0000FFFFUL)

/*  Bit definition for TMR2_CNTBR register  */
#define TMR2_CNTBR_CNTB                                (0x0000FFFFUL)

/*  Bit definition for TMR2_CMPAR register  */
#define TMR2_CMPAR_CMPA                                (0x0000FFFFUL)

/*  Bit definition for TMR2_CMPBR register  */
#define TMR2_CMPBR_CMPB                                (0x0000FFFFUL)

/*  Bit definition for TMR2_BCONR register  */
#define TMR2_BCONR_CSTA_POS                            (0U)
#define TMR2_BCONR_CSTA                                (0x00000001UL)
#define TMR2_BCONR_CAPMDA_POS                          (1U)
#define TMR2_BCONR_CAPMDA                              (0x00000002UL)
#define TMR2_BCONR_SYNSA_POS                           (3U)
#define TMR2_BCONR_SYNSA                               (0x00000008UL)
#define TMR2_BCONR_CKDIVA_POS                          (4U)
#define TMR2_BCONR_CKDIVA                              (0x000000F0UL)
#define TMR2_BCONR_SYNCLKA_POS                         (8U)
#define TMR2_BCONR_SYNCLKA                             (0x00000300UL)
#define TMR2_BCONR_SYNCLKA_0                           (0x00000100UL)
#define TMR2_BCONR_SYNCLKA_1                           (0x00000200UL)
#define TMR2_BCONR_ASYNCLKA_POS                        (10U)
#define TMR2_BCONR_ASYNCLKA                            (0x00000C00UL)
#define TMR2_BCONR_ASYNCLKA_0                          (0x00000400UL)
#define TMR2_BCONR_ASYNCLKA_1                          (0x00000800UL)
#define TMR2_BCONR_SYNCLKAT_POS                        (12U)
#define TMR2_BCONR_SYNCLKAT                            (0x00003000UL)
#define TMR2_BCONR_SYNCLKAT_0                          (0x00001000UL)
#define TMR2_BCONR_SYNCLKAT_1                          (0x00002000UL)
#define TMR2_BCONR_CSTB_POS                            (16U)
#define TMR2_BCONR_CSTB                                (0x00010000UL)
#define TMR2_BCONR_CAPMDB_POS                          (17U)
#define TMR2_BCONR_CAPMDB                              (0x00020000UL)
#define TMR2_BCONR_SYNSB_POS                           (19U)
#define TMR2_BCONR_SYNSB                               (0x00080000UL)
#define TMR2_BCONR_CKDIVB_POS                          (20U)
#define TMR2_BCONR_CKDIVB                              (0x00F00000UL)
#define TMR2_BCONR_SYNCLKB_POS                         (24U)
#define TMR2_BCONR_SYNCLKB                             (0x03000000UL)
#define TMR2_BCONR_SYNCLKB_0                           (0x01000000UL)
#define TMR2_BCONR_SYNCLKB_1                           (0x02000000UL)
#define TMR2_BCONR_ASYNCLKB_POS                        (26U)
#define TMR2_BCONR_ASYNCLKB                            (0x0C000000UL)
#define TMR2_BCONR_ASYNCLKB_0                          (0x04000000UL)
#define TMR2_BCONR_ASYNCLKB_1                          (0x08000000UL)
#define TMR2_BCONR_SYNCLKBT_POS                        (28U)
#define TMR2_BCONR_SYNCLKBT                            (0x30000000UL)
#define TMR2_BCONR_SYNCLKBT_0                          (0x10000000UL)
#define TMR2_BCONR_SYNCLKBT_1                          (0x20000000UL)

/*  Bit definition for TMR2_ICONR register  */
#define TMR2_ICONR_CMENA_POS                           (0U)
#define TMR2_ICONR_CMENA                               (0x00000001UL)
#define TMR2_ICONR_OVENA_POS                           (1U)
#define TMR2_ICONR_OVENA                               (0x00000002UL)
#define TMR2_ICONR_CMENB_POS                           (16U)
#define TMR2_ICONR_CMENB                               (0x00010000UL)
#define TMR2_ICONR_OVENB_POS                           (17U)
#define TMR2_ICONR_OVENB                               (0x00020000UL)

/*  Bit definition for TMR2_PCONR register  */
#define TMR2_PCONR_STACA_POS                           (0U)
#define TMR2_PCONR_STACA                               (0x00000003UL)
#define TMR2_PCONR_STACA_0                             (0x00000001UL)
#define TMR2_PCONR_STACA_1                             (0x00000002UL)
#define TMR2_PCONR_STPCA_POS                           (2U)
#define TMR2_PCONR_STPCA                               (0x0000000CUL)
#define TMR2_PCONR_STPCA_0                             (0x00000004UL)
#define TMR2_PCONR_STPCA_1                             (0x00000008UL)
#define TMR2_PCONR_CMPCA_POS                           (4U)
#define TMR2_PCONR_CMPCA                               (0x00000030UL)
#define TMR2_PCONR_CMPCA_0                             (0x00000010UL)
#define TMR2_PCONR_CMPCA_1                             (0x00000020UL)
#define TMR2_PCONR_OUTENA_POS                          (8U)
#define TMR2_PCONR_OUTENA                              (0x00000100UL)
#define TMR2_PCONR_NOFIENA_POS                         (12U)
#define TMR2_PCONR_NOFIENA                             (0x00001000UL)
#define TMR2_PCONR_NOFICKA_POS                         (13U)
#define TMR2_PCONR_NOFICKA                             (0x00006000UL)
#define TMR2_PCONR_NOFICKA_0                           (0x00002000UL)
#define TMR2_PCONR_NOFICKA_1                           (0x00004000UL)
#define TMR2_PCONR_STACB_POS                           (16U)
#define TMR2_PCONR_STACB                               (0x00030000UL)
#define TMR2_PCONR_STACB_0                             (0x00010000UL)
#define TMR2_PCONR_STACB_1                             (0x00020000UL)
#define TMR2_PCONR_STPCB_POS                           (18U)
#define TMR2_PCONR_STPCB                               (0x000C0000UL)
#define TMR2_PCONR_STPCB_0                             (0x00040000UL)
#define TMR2_PCONR_STPCB_1                             (0x00080000UL)
#define TMR2_PCONR_CMPCB_POS                           (20U)
#define TMR2_PCONR_CMPCB                               (0x00300000UL)
#define TMR2_PCONR_CMPCB_0                             (0x00100000UL)
#define TMR2_PCONR_CMPCB_1                             (0x00200000UL)
#define TMR2_PCONR_OUTENB_POS                          (24U)
#define TMR2_PCONR_OUTENB                              (0x01000000UL)
#define TMR2_PCONR_NOFIENB_POS                         (28U)
#define TMR2_PCONR_NOFIENB                             (0x10000000UL)
#define TMR2_PCONR_NOFICKB_POS                         (29U)
#define TMR2_PCONR_NOFICKB                             (0x60000000UL)
#define TMR2_PCONR_NOFICKB_0                           (0x20000000UL)
#define TMR2_PCONR_NOFICKB_1                           (0x40000000UL)

/*  Bit definition for TMR2_HCONR register  */
#define TMR2_HCONR_HSTAA0_POS                          (0U)
#define TMR2_HCONR_HSTAA0                              (0x00000001UL)
#define TMR2_HCONR_HSTAA1_POS                          (1U)
#define TMR2_HCONR_HSTAA1                              (0x00000002UL)
#define TMR2_HCONR_HSTAA2_POS                          (2U)
#define TMR2_HCONR_HSTAA2                              (0x00000004UL)
#define TMR2_HCONR_HSTPA0_POS                          (4U)
#define TMR2_HCONR_HSTPA0                              (0x00000010UL)
#define TMR2_HCONR_HSTPA1_POS                          (5U)
#define TMR2_HCONR_HSTPA1                              (0x00000020UL)
#define TMR2_HCONR_HSTPA2_POS                          (6U)
#define TMR2_HCONR_HSTPA2                              (0x00000040UL)
#define TMR2_HCONR_HCLEA0_POS                          (8U)
#define TMR2_HCONR_HCLEA0                              (0x00000100UL)
#define TMR2_HCONR_HCLEA1_POS                          (9U)
#define TMR2_HCONR_HCLEA1                              (0x00000200UL)
#define TMR2_HCONR_HCLEA2_POS                          (10U)
#define TMR2_HCONR_HCLEA2                              (0x00000400UL)
#define TMR2_HCONR_HICPA0_POS                          (12U)
#define TMR2_HCONR_HICPA0                              (0x00001000UL)
#define TMR2_HCONR_HICPA1_POS                          (13U)
#define TMR2_HCONR_HICPA1                              (0x00002000UL)
#define TMR2_HCONR_HICPA2_POS                          (14U)
#define TMR2_HCONR_HICPA2                              (0x00004000UL)
#define TMR2_HCONR_HSTAB0_POS                          (16U)
#define TMR2_HCONR_HSTAB0                              (0x00010000UL)
#define TMR2_HCONR_HSTAB1_POS                          (17U)
#define TMR2_HCONR_HSTAB1                              (0x00020000UL)
#define TMR2_HCONR_HSTAB2_POS                          (18U)
#define TMR2_HCONR_HSTAB2                              (0x00040000UL)
#define TMR2_HCONR_HSTPB0_POS                          (20U)
#define TMR2_HCONR_HSTPB0                              (0x00100000UL)
#define TMR2_HCONR_HSTPB1_POS                          (21U)
#define TMR2_HCONR_HSTPB1                              (0x00200000UL)
#define TMR2_HCONR_HSTPB2_POS                          (22U)
#define TMR2_HCONR_HSTPB2                              (0x00400000UL)
#define TMR2_HCONR_HCLEB0_POS                          (24U)
#define TMR2_HCONR_HCLEB0                              (0x01000000UL)
#define TMR2_HCONR_HCLEB1_POS                          (25U)
#define TMR2_HCONR_HCLEB1                              (0x02000000UL)
#define TMR2_HCONR_HCLEB2_POS                          (26U)
#define TMR2_HCONR_HCLEB2                              (0x04000000UL)
#define TMR2_HCONR_HICPB0_POS                          (28U)
#define TMR2_HCONR_HICPB0                              (0x10000000UL)
#define TMR2_HCONR_HICPB1_POS                          (29U)
#define TMR2_HCONR_HICPB1                              (0x20000000UL)
#define TMR2_HCONR_HICPB2_POS                          (30U)
#define TMR2_HCONR_HICPB2                              (0x40000000UL)

/*  Bit definition for TMR2_STFLR register  */
#define TMR2_STFLR_CMFA_POS                            (0U)
#define TMR2_STFLR_CMFA                                (0x00000001UL)
#define TMR2_STFLR_OVFA_POS                            (1U)
#define TMR2_STFLR_OVFA                                (0x00000002UL)
#define TMR2_STFLR_CMFB_POS                            (16U)
#define TMR2_STFLR_CMFB                                (0x00010000UL)
#define TMR2_STFLR_OVFB_POS                            (17U)
#define TMR2_STFLR_OVFB                                (0x00020000UL)

