txt1994/ARM/HC32_Template/User/hc32f4a0sitb.h
/*******************************************************************************
                Bit definition for Peripheral TMR6CR
*******************************************************************************/
/*  Bit definition for TMR6CR_FCNTR register  */
#define TMR6CR_FCNTR_NOFIENTA_POS                      (0U)
#define TMR6CR_FCNTR_NOFIENTA                          (0x00000001UL)
#define TMR6CR_FCNTR_NOFICKTA_POS                      (1U)
#define TMR6CR_FCNTR_NOFICKTA                          (0x00000006UL)
#define TMR6CR_FCNTR_NOFICKTA_0                        (0x00000002UL)
#define TMR6CR_FCNTR_NOFICKTA_1                        (0x00000004UL)
#define TMR6CR_FCNTR_NOFIENTB_POS                      (4U)
#define TMR6CR_FCNTR_NOFIENTB                          (0x00000010UL)
#define TMR6CR_FCNTR_NOFICKTB_POS                      (5U)
#define TMR6CR_FCNTR_NOFICKTB                          (0x00000060UL)
#define TMR6CR_FCNTR_NOFICKTB_0                        (0x00000020UL)
#define TMR6CR_FCNTR_NOFICKTB_1                        (0x00000040UL)
#define TMR6CR_FCNTR_NOFIENTC_POS                      (8U)
#define TMR6CR_FCNTR_NOFIENTC                          (0x00000100UL)
#define TMR6CR_FCNTR_NOFICKTC_POS                      (9U)
#define TMR6CR_FCNTR_NOFICKTC                          (0x00000600UL)
#define TMR6CR_FCNTR_NOFICKTC_0                        (0x00000200UL)
#define TMR6CR_FCNTR_NOFICKTC_1                        (0x00000400UL)
#define TMR6CR_FCNTR_NOFIENTD_POS                      (12U)
#define TMR6CR_FCNTR_NOFIENTD                          (0x00001000UL)
#define TMR6CR_FCNTR_NOFICKTD_POS                      (13U)
#define TMR6CR_FCNTR_NOFICKTD                          (0x00006000UL)
#define TMR6CR_FCNTR_NOFICKTD_0                        (0x00002000UL)
#define TMR6CR_FCNTR_NOFICKTD_1                        (0x00004000UL)

/*  Bit definition for TMR6CR_SSTAR register  */
#define TMR6CR_SSTAR_SSTA1_POS                         (0U)
#define TMR6CR_SSTAR_SSTA1                             (0x00000001UL)
#define TMR6CR_SSTAR_SSTA2_POS                         (1U)
#define TMR6CR_SSTAR_SSTA2                             (0x00000002UL)
#define TMR6CR_SSTAR_SSTA3_POS                         (2U)
#define TMR6CR_SSTAR_SSTA3                             (0x00000004UL)
#define TMR6CR_SSTAR_SSTA4_POS                         (3U)
#define TMR6CR_SSTAR_SSTA4                             (0x00000008UL)
#define TMR6CR_SSTAR_SSTA5_POS                         (4U)
#define TMR6CR_SSTAR_SSTA5                             (0x00000010UL)
#define TMR6CR_SSTAR_SSTA6_POS                         (5U)
#define TMR6CR_SSTAR_SSTA6                             (0x00000020UL)
#define TMR6CR_SSTAR_SSTA7_POS                         (6U)
#define TMR6CR_SSTAR_SSTA7                             (0x00000040UL)
#define TMR6CR_SSTAR_SSTA8_POS                         (7U)
#define TMR6CR_SSTAR_SSTA8                             (0x00000080UL)

/*  Bit definition for TMR6CR_SSTPR register  */
#define TMR6CR_SSTPR_SSTP1_POS                         (0U)
#define TMR6CR_SSTPR_SSTP1                             (0x00000001UL)
#define TMR6CR_SSTPR_SSTP2_POS                         (1U)
#define TMR6CR_SSTPR_SSTP2                             (0x00000002UL)
#define TMR6CR_SSTPR_SSTP3_POS                         (2U)
#define TMR6CR_SSTPR_SSTP3                             (0x00000004UL)
#define TMR6CR_SSTPR_SSTP4_POS                         (3U)
#define TMR6CR_SSTPR_SSTP4                             (0x00000008UL)
#define TMR6CR_SSTPR_SSTP5_POS                         (4U)
#define TMR6CR_SSTPR_SSTP5                             (0x00000010UL)
#define TMR6CR_SSTPR_SSTP6_POS                         (5U)
#define TMR6CR_SSTPR_SSTP6                             (0x00000020UL)
#define TMR6CR_SSTPR_SSTP7_POS                         (6U)
#define TMR6CR_SSTPR_SSTP7                             (0x00000040UL)
#define TMR6CR_SSTPR_SSTP8_POS                         (7U)
#define TMR6CR_SSTPR_SSTP8                             (0x00000080UL)

/*  Bit definition for TMR6CR_SCLRR register  */
#define TMR6CR_SCLRR_SCLE1_POS                         (0U)
#define TMR6CR_SCLRR_SCLE1                             (0x00000001UL)
#define TMR6CR_SCLRR_SCLE2_POS                         (1U)
#define TMR6CR_SCLRR_SCLE2                             (0x00000002UL)
#define TMR6CR_SCLRR_SCLE3_POS                         (2U)
#define TMR6CR_SCLRR_SCLE3                             (0x00000004UL)
#define TMR6CR_SCLRR_SCLE4_POS                         (3U)
#define TMR6CR_SCLRR_SCLE4                             (0x00000008UL)
#define TMR6CR_SCLRR_SCLE5_POS                         (4U)
#define TMR6CR_SCLRR_SCLE5                             (0x00000010UL)
#define TMR6CR_SCLRR_SCLE6_POS                         (5U)
#define TMR6CR_SCLRR_SCLE6                             (0x00000020UL)
#define TMR6CR_SCLRR_SCLE7_POS                         (6U)
#define TMR6CR_SCLRR_SCLE7                             (0x00000040UL)
#define TMR6CR_SCLRR_SCLE8_POS                         (7U)
#define TMR6CR_SCLRR_SCLE8                             (0x00000080UL)

/*  Bit definition for TMR6CR_SUPDR register  */
#define TMR6CR_SUPDR_SUPD1_POS                         (0U)
#define TMR6CR_SUPDR_SUPD1                             (0x00000001UL)
#define TMR6CR_SUPDR_SUPD2_POS                         (1U)
#define TMR6CR_SUPDR_SUPD2                             (0x00000002UL)
#define TMR6CR_SUPDR_SUPD3_POS                         (2U)
#define TMR6CR_SUPDR_SUPD3                             (0x00000004UL)
#define TMR6CR_SUPDR_SUPD4_POS                         (3U)
#define TMR6CR_SUPDR_SUPD4                             (0x00000008UL)
#define TMR6CR_SUPDR_SUPD5_POS                         (4U)
#define TMR6CR_SUPDR_SUPD5                             (0x00000010UL)
#define TMR6CR_SUPDR_SUPD6_POS                         (5U)
#define TMR6CR_SUPDR_SUPD6                             (0x00000020UL)
#define TMR6CR_SUPDR_SUPD7_POS                         (6U)
#define TMR6CR_SUPDR_SUPD7                             (0x00000040UL)
#define TMR6CR_SUPDR_SUPD8_POS                         (7U)
#define TMR6CR_SUPDR_SUPD8                             (0x00000080UL)

